БИТУправление_медицинским_центром_демо/src/Documents/РеестрОказанныхУслугПоСоглашениям/РеестрОказанныхУслугПоСоглашениям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеестрОказанныхУслугПоСоглашениям</name>
  <registerRecords>AccumulationRegister.ВзаиморасчетыСКонтрагентами</registerRecords>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Соглашение</name>
    <type>
      <types>CatalogRef.СоглашенияСтрахования</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Клиент</name>
      <type>
        <types>CatalogRef.Клиенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Полис</name>
      <type>
        <types>CatalogRef.СтраховыеПолисы</types>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Диагноз</name>
      <type>
        <types>CatalogRef.Диагнозы</types>
      </type>
    </attributes>
    <attributes>
      <name>Зуб</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СегментЗуба</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументПродажи</name>
      <type>
        <types>DocumentRef.ОказаниеУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

БИТУправление_медицинским_центром_демо/src/Catalogs/СоглашенияСтрахования/СоглашенияСтрахования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СоглашенияСтрахования</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Прейскурант</name>
    <type>
      <types>CatalogRef.Прейскуранты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДоговора</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
</mdclass:Catalog>

БИТУправление_медицинским_центром_демо/src/Documents/РеестрОказанныхУслугПоСоглашениям/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормамиСервер.ФормаДокументаПриОткрытииСервер(ЭтаФорма);
	Организация = Объект.Филиал.Организация;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПечатьДокументовКлиент.УстановитьЗаголовокПечатнойФормы(ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	РаботаСФормамиСервер.ВывестиЗаголовокФормыДокумента(Объект.Ссылка, Ложь, ЭтаФорма);	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьСоставУслуг(Команда)
	
	Заполнено = Истина;
	Если Не ЗначениеЗаполнено(Объект.Контрагент) Тогда
		Заполнено = Ложь;
		ПоказатьПредупреждение(, НСтр("ru='Укажите контрагента'"));
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.Соглашение) Тогда
		Заполнено = Ложь;
		ПоказатьПредупреждение(, НСтр("ru='Укажите договор с контрагентом'"));
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.НачалоПериода)
		Или Не ЗначениеЗаполнено(Объект.КонецПериода)
	Тогда
		Заполнено = Ложь;
		ПоказатьПредупреждение(, НСтр("ru='Укажите период, за который формируется реестр'"));
		
	ИначеЕсли Заполнено Тогда
		ДоговорДатаНачала	 = ДопСерверныеФункции.ПолучитьРеквизит(Объект.Соглашение, "ДатаНачала");
		ДоговорДатаКонца	 = ДопСерверныеФункции.ПолучитьРеквизит(Объект.Соглашение, "ДатаОкончания");
		
		Если	 (ЗначениеЗаполнено(ДоговорДатаНачала)	 И ДоговорДатаНачала > Объект.НачалоПериода)
			Или  (ЗначениеЗаполнено(ДоговорДатаКонца)	 И ДоговорДатаКонца	 < Объект.КонецПериода)
		Тогда
			ПоказатьПредупреждение(, НСтр("ru='Период документа не вписывается в период действия договора. Заполнение может быть некорректным.'"));
		КонецЕсли;
	КонецЕсли;
	
	Если Заполнено Тогда
		Если Объект.Услуги.Количество() <> 0 Тогда
			Если Вопрос(НСтр("ru='Табличная часть будет очищена. Продолжить?'"), РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
				Объект.Услуги.Очистить();
				ЗаполнитьСоставУслугСервер();
			КонецЕсли;
		Иначе
			ЗаполнитьСоставУслугСервер();
			Состояние(НСтр("ru='Операция завершена'"));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьПериод(Команда)
	
	Период = Новый СтандартныйПериод;
	Период.ДатаНачала = Объект.НачалоПериода;
	Период.ДатаОкончания = ?(ЗначениеЗаполнено(Объект.КонецПериода), КонецДня(Объект.КонецПериода), Дата(1,1,1));
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода;
	Диалог.Период = Период;
	Если Диалог.Редактировать() Тогда
		Объект.НачалоПериода = Диалог.Период.ДатаНачала;
		Объект.КонецПериода = Диалог.Период.ДатаОкончания;
	КонецЕсли;
	
КонецПроцедуры

#Область ОбработчикиДинамическиСоздаваемыхКоманд

&НаКлиенте
Процедура Подключаемый_КнопкаФилиалПриНажатии(Команда)
	
	ОповещениеОВыборе = Новый ОписаниеОповещения("Подключаемый_КнопкаФилиалПриНажатииЗавершение", ЭтотОбъект);
	РаботаСДиалогамиКлиент.ДиалогКнопкаФилиалПриНажатии(ЭтотОбъект, , ОповещениеОВыборе);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КнопкаФилиалПриНажатииЗавершение(Результат, ДополнительныеЗначения) Экспорт
	
	Организация = ДопСерверныеФункции.ПолучитьРеквизит(Объект.Филиал, "Организация");
	
	// Контроль организации договора
	Если ЗначениеЗаполнено(Объект.Соглашение) Тогда
		ОрганизацияДоговора = ДопСерверныеФункции.ПолучитьРеквизит(Объект.Соглашение, "Организация");
		Если ОрганизацияДоговора <> Организация Тогда
			Объект.Соглашение = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВывестиДвиженияДокумента(Команда)
	РаботаСДиалогамиКлиент.ВывестиДвиженияДокумента(Объект.Ссылка, Команда);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	ПодставитьСоглашениеСервер();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСоставУслугСервер()
	
	Документы.РеестрОказанныхУслугПоСоглашениям.ЗаполнитьСоставУслугДокумента(Объект);
	
КонецПроцедуры

&НаСервере
Процедура ПодставитьСоглашениеСервер()
	Если Объект.Контрагент <> Объект.Соглашение.Владелец Тогда
		Объект.Соглашение = Справочники.СоглашенияСтрахования.ПустаяСсылка();
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СоглашенияСтрахования.Ссылка
	|ИЗ
	|	Справочник.СоглашенияСтрахования КАК СоглашенияСтрахования
	|ГДЕ
	|	СоглашенияСтрахования.Владелец = &Владелец";
	
	Запрос.УстановитьПараметр("Владелец", Объект.Контрагент);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выгрузить();
	Если Выборка.Количество() = 1 Тогда
		Объект.Соглашение = Выборка[0].Ссылка; 
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
